Kegg233/STM32/DC-AC/SPWM逆变/32控制/逆变器控制软件/BSP/eeprom.c
  /* Return last operation flash status */
  return FlashStatus;
}

/**
  * @}
  */ 
// Add writestring functions
uint16_t EE_WriteString(uint16_t VirtAddress, uint8_t *str)
{
	uint8_t index;
	uint16_t ValueTemp;
	uint16_t AddressEnd;
	for (index = 0;index <strlen((const char *)str)/2+1;index++) // Add one space when string length is	odd number
	{
		ValueTemp = str[index*2]*256+str[index*2+1];			 // Turn to 16bit form 2 num of char
		EE_WriteVariable(VirtAddress+index,ValueTemp);
	}
	AddressEnd = VirtAddress+index;
	return AddressEnd;
}
// Add readstring functions
void EE_ReadString(uint16_t VirtAddress, uint8_t *str)
{
	uint8_t index;
	uint16_t Read_Stringtemp;
	for (index=0;index<strlen((const char *)str)/2+1;index++)
	{
		EE_ReadVariable(VirtAddress+index,&Read_Stringtemp);
		str[index*2+1] = Read_Stringtemp;
		str[index*2]   = Read_Stringtemp/256;
	}
} 

uint16_t EepromWrite(uint16_t Address, unsigned char Data)
{
	   uint16_t	value;
	   value = EE_WriteString(Address,&Data);
	   return value;
}

 unsigned char EepromRead( uint16_t Address)
 {
	 unsigned char Read_String;
	 EE_ReadString(Address,&Read_String);
	 return   Read_String;

 }
void  DoubleWrite( uint16_t address, float value)	//double 存
{
	INT16U temp;
	INT32U val,val2=10000;
	
	val=(INT32U)(value*val2);
	temp=(INT16U)(val&0x0000ffff);
	EE_WriteInt16(address,temp);

	temp=(INT16U)((val>>16)&0x0000ffff);
	EE_WriteInt16(address+1,temp);

}

char   DoubleRead( uint16_t address,float *tt )	//double 写
{
	long int  val=0;
	INT16U temp,flag;
	
	flag=(INT16U)EE_ReadInt16(address+1,&temp);
	val=(val+temp)<<16;
	flag=(INT16U)EE_ReadInt16(address,&temp);
	val=(val+temp);

	*tt=(float)val/10000;
	return flag;
}
void Int16UWrite(INT16U VirtAddress, INT16U Data)
{
	 EE_WriteInt16(VirtAddress, Data);
}
INT16U Int16Read(INT16U VirtAddress, INT16U* Data)
{
	uint16_t ReadStatus = 1;
	ReadStatus=EE_ReadInt16(VirtAddress,  &(*Data));
	return ReadStatus;
}
/**
  * @brief  Writes/upadtes variable data in EEPROM.
  * @param  VirtAddress: Variable virtual address
  * @param  Data: 16 bit data to be written
  * @retval Success or error status:
  *           - FLASH_COMPLETE: on success
  *           - PAGE_FULL: if valid page is full
  *           - NO_VALID_PAGE: if no valid page was found
  *           - Flash error code: on write Flash error
  */
INT16U EE_WriteInt16(INT16U VirtAddress, INT16U Data)
{
  uint16_t Status = 0;

  /* Write the variable virtual address and value in the EEPROM */
  Status = EE_VerifyPageFullWriteVariable(VirtAddress, Data);

  /* In case the EEPROM active page is full */
  if (Status == PAGE_FULL)
  {
    /* Perform Page transfer */
    Status = EE_PageTransfer(VirtAddress, Data);
  }

  /* Return last operation status */
  return Status;
}

INT16U EE_ReadInt16(INT16U VirtAddress, INT16U* Data)
{
  uint16_t ValidPage = PAGE0;
  uint16_t AddressValue = 0x5555, ReadStatus = 1;
  uint32_t Address = 0x08010000, PageStartAddress = 0x08010000;

  /* Get active Page for read operation */
  ValidPage = EE_FindValidPage(READ_FROM_VALID_PAGE);

  /* Check if there is no valid page */
  if (ValidPage == NO_VALID_PAGE)
  {
    return  NO_VALID_PAGE;
  }

  /* Get the valid Page start Address */
  PageStartAddress = (uint32_t)(EEPROM_START_ADDRESS + (uint32_t)(ValidPage * PAGE_SIZE));

  /* Get the valid Page end Address */
  Address = (uint32_t)((EEPROM_START_ADDRESS - 2) + (uint32_t)((1 + ValidPage) * PAGE_SIZE));

  /* Check each active page address starting from end */
  while (Address > (PageStartAddress + 2))
  {
    /* Get the current location content to be compared with virtual address */
    AddressValue = (*(__IO uint16_t*)Address);

    /* Compare the read address with the virtual address */
    if (AddressValue == VirtAddress)
    {
      /* Get content of Address-2 which is variable value */
      *Data = (*(__IO uint16_t*)(Address - 2));

      /* In case variable value is read, reset ReadStatus flag */
      ReadStatus = 0;

      break;
    }
    else
    {
      /* Next address location */
      Address = Address - 4;
    }
  }

  /* Return ReadStatus value: (0: variable exist, 1: variable doesn't exist) */
  return ReadStatus;
}


/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
